[
    {
        "id": "01",
        "picture": "https://i.postimg.cc/j24n2jQM/phython.png",
        "duration": "6 Months",
        "details": "If you’re looking for a programming language that’s flexible and easy to read, try learning Python. It’s one of the most popular languages today, and programming in Python is used for everything from web and software development to data science and analytics to quality assurance.",
        "skills": [
            "Write Python 3 programs",
            "Take your skills off-platform",
            "Simplify the code you write"
        ],
        "name": "Python",
        "about": "Python is a general-purpose, versatile, and powerful programming language. It’s a great first language because Python code is concise and easy to read. Whatever you want to do, python can do it. From web development to machine learning to data science, Python is the language for you."
    },
    {
        "id": "02",
        "picture": "https://i.postimg.cc/h4zCvRmc/javascript.png",
        "duration": "4 Months",
        "details": "You interact with JavaScript code all the time — you just might not realize it. It powers dynamic behavior on websites (like this one) and plays an important role in many fields, like front- and back-end engineering, game and mobile development, virtual reality, and more. In this course, you’ll learn JavaScript fundamentals that will be helpful as you dive deeper into more advanced topics.",
        "skills": [
            "Build core programming concepts",
            "Learn object-oriented concepts",
            "Read and write JavaScript syntax"
        ],
        "name": "JavaScript",
        "about": "The JavaScript programming language is fun and flexible. It’s one of the core technologies of web development and can be used on both the front-end and the back-end."
    },
    {
        "id": "03",
        "picture": "https://i.postimg.cc/fbs4jTxc/What-is-PHP-for-Web-Development.jpg",
        "duration": "4 Months",
        "details": "PHP is a widely used server-side scripting language that has become increasingly fast and powerful through the years. You can also use it on the front-end since PHP can be embedded right into HTML. These features make learning PHP a great option for any web developer. In this course, you’ll work through PHP fundamental programming concepts and gain the skills necessary to develop programs in PHP.",
        "skills": [
            "Fundamental programming concepts",
            "Use PHP with HTML forms",
            "Create classes and objects"
        ],
        "name": "PHP",
        "about": "PHP is a general-purpose scripting language widely used as a server-side language for creating dynamic web pages. Though its reputation is mixed, PHP is still extremely popular and is used in over 75% of all websites where the server-side programming language is known."
    },
    {
        "id": "04",
        "picture": "https://i.postimg.cc/CK5G2bHS/kotlin.png",
        "duration": "6 Months",
        "details": "Kotlin is a modern, expressive programming language made with developers in mind. Concise, open-source, and safe, Kotlin is a popular language for Android development, web development, and more.",
        "skills": [
            "You will be introduced to fundamental programming topics",
            "writing your first print statement to creating your own objects and classes using the Kotlin programming language",
            "you’ll hone your knowledge and programming skillset with quizzes and real-world projects."
        ],
        "name": "Kotlin",
        "about": "Kotlin is a modern, general-purpose programming language developed by JetBrains. Its full compatibility with Java and concise syntax makes it an appealing language for web development, Android development, and more."
    },
    {
        "id": "05",
        "picture": "https://i.postimg.cc/qMKyymbf/Csharp.jpg",
        "duration": "1 Year",
        "details": "The C# programming language offers flexible and comprehensive libraries that make it easy to work across operating systems. That’s why it’s widely used by companies like Microsoft and Stack Overflow. Whether you want to develop websites, apps, video games, or virtual reality, building your foundation is key. In this course, you’ll learn C# basics so you can become a more versatile programmer.",
        "skills": [
            "Use core C# programming concepts",
            "Write your own C# programs",
            "Learn object-oriented programming"
        ],
        "name": "C#",
        "about": "C# is one of the most popular programming languages. It can be used for a variety of things, including mobile applications, game development, and enterprise software. Knowing C# opens a great deal of doors for you as a developer."
    },
    {
        "id": "06",
        "picture": "https://i.postimg.cc/NGH5zK1m/CPP.jpg",
        "duration": "3 Months",
        "details": "With its adaptability and fast rendering, you’ll find the C++ programming language used everywhere, from web browsers to game development and operating systems to science and machine learning tools. This course will help you learn C++ basics and give you hands-on experience to create your own projects and work with computer memory.",
        "skills": [
            "Build core programming concepts",
            "Understand pointers and memory",
            "Build C++ projects"
        ],
        "name": "C++",
        "about": "C++ is a very popular language for performance-critical applications that rely on speed and efficient memory management. It’s used in a wide range of industries including software and game development, VR, robotics, and scientific computing."
    }
]